Tekla Open API Reference for Tekla Structures 2025
Rotation3D Constructor
Overload List
Name | Description
Rotation3D()
Initializes a new instance of the Rotation3D class.
Rotation3D(Vector, Vector)
Initializes a new instance of the Rotation3D class.
Top
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace